DataProcessors/ОбработкаФайлаСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаФайлаСМС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/СМСсообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СМСсообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаФайлаСМС/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
  	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	

	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВEXCEL(Команда)
		
	  ТЧ.Очистить(); 
	
	   мСтрокФайла = Новый Массив();
	
	  ВыбранныйФайл = Новый Файл(ИмяФайла);
	  Если ВыбранныйФайл.Существует() Тогда
		  
		имядляФЕ=Лев(ИмяФайла,СтрДлина(ИмяФайла)-3);  
		
		имядляФЕ=имядляФЕ+"XLS";
		  
		  Если ОтДруга Тогда
		  
		  	    ПрочитанныйТекст = Новый ЧтениеТекста(ИмяФайла);
		  
		  Иначе
		  
		  	    ПрочитанныйТекст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
		  
		  КонецЕсли;
		
			//ПрочитанныйТекст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
			
			
			
	     	Строка = ПрочитанныйТекст.ПрочитатьСтроку();
			
			мСтрокФайла.Добавить(Строка);
			
					Пока Строка <> Неопределено Цикл
                       Строка = ПрочитанныйТекст.ПрочитатьСтроку();
					   
					   мСтрокФайла.Добавить(Строка);
					   
				    КонецЦикла; 
		  

			Для каждого стрк  Из мСтрокФайла Цикл
			
				   Разделитель = Символ(59);
	               Строки = СтрЗаменить(стрк, Разделитель, Символы.ПС);
				   
				   датаСтр="";
				   номерТелеф="";
				   текстСооб="";
				   отчетОДост="";
				   
				   
				   Если ОтДруга Тогда
					   
					      Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
							   
							      датаСтр=СтрЗаменить(СтрПолучитьСтроку(Строки, 1),Символ(34),"");
								  номерТелеф=СтрЗаменить(СтрПолучитьСтроку(Строки, 2),Символ(34),"");
								  текстСооб=СтрЗаменить(СтрПолучитьСтроку(Строки, 3),Символ(34),"");
								  отчетОДост=СтрЗаменить(СтрПолучитьСтроку(Строки, 4),Символ(34),"");
							   
						   КонецЦикла;	
						  
				   	
				   
				   Иначе
				            Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
							   
							      датаСтр=СтрЗаменить(СтрПолучитьСтроку(Строки, 2),Символ(34),"");
								  номерТелеф=СтрЗаменить(СтрПолучитьСтроку(Строки, 3),Символ(34),"");
								  текстСооб=СтрЗаменить(СтрПолучитьСтроку(Строки, 4),Символ(34),"");
								  отчетОДост=СтрЗаменить(СтрПолучитьСтроку(Строки, 6),Символ(34),"");
							   
						   КонецЦикла;	
						   

				   	
				   
				   КонецЕсли;
				   
										   
				   
				   
				   Если датаСтр<>"" Тогда
				   
				   	      	  новаяЗапись=ТЧ.Добавить();
							  
							  новаяЗапись.Дата=датаСтр;
							  новаяЗапись.Номер=номерТелеф;
							  новаяЗапись.Текст=текстСооб;
							  новаяЗапись.ОтчетОДоставке=отчетОДост;
							  
							  // попробую найти должника по номеру телефона
							  
							  номерТ=Прав(номерТелеф,СтрДлина(номерТелеф)-1);
							    
							  должДоговор= НайтиДолжникаПоНомеруТелефона("8"+номерТ); 
							  
							  Если должДоговор.ФИО<>""  Тогда
							  
							  	   новаяЗапись.Должник=должДоговор.ФИО;
							  
							  КонецЕсли;
							  
							  Если должДоговор.Договор<>""  Тогда
							  
							  	   новаяЗапись.НомерДоговора=должДоговор.Договор;
							  
							  КонецЕсли;
						
				   
				   КонецЕсли;
				   
				  //  		  новаяЗапись=ТЧ.Добавить();
				  //  		  
				  //  		  новаяЗапись.Дата=датаСтр;
				  //  		  новаяЗапись.Номер=номерТелеф;
				  //  		  новаяЗапись.Текст=текстСооб;
				  //  		  новаяЗапись.ОтчетОДоставке=отчетОДост;
				  //  		  
				  //  		  // попробую найти должника по номеру телефона
				  //  		  
				  //  		  номерТ=Прав(номерТелеф,СтрДлина(номерТелеф)-1);
				  //  		    
				  //  		  должДоговор= НайтиДолжникаПоНомеруТелефона("8"+номерТ); 
				  //  		  
				  //  		  Если должДоговор.ФИО<>""  Тогда
				  //  		  
				  //  		  	   новаяЗапись.Должник=должДоговор.ФИО;
				  //  		  
				  //  		  КонецЕсли;
				  //  		  
				  //  		  Если должДоговор.Договор<>""  Тогда
				  //  		  
				  //  		  	   новаяЗапись.НомерДоговора=должДоговор.Договор;
				  //  		  
				  //  		  КонецЕсли;
				  //  		  
				  //
				   
			КонецЦикла;		
						
		 	
			
	      табдок=ЗаполнитьТабДок();	
		  
		  табдок.Записать(имядляФЕ, ТипФайлаТабличногоДокумента.XLS);
			
					
			 
			 
		  
	  КонецЕсли;	  
		  
		  
	 Сообщить("Ок");
	
	
КонецПроцедуры



&НаСервере
Функция НайтиДолжникаПоНомеруТелефона(тел)

	
	   долждог=Новый Структура;
	   
	   долж=Неопределено;
	   
	   догНомер="";
	   должФИО="";
	   
					     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Телефоны.Владелец КАК Владелец
						|ИЗ
						|	Справочник.Телефоны КАК Телефоны
						|ГДЕ
						|	Телефоны.Номер ПОДОБНО &Номер";
					
					Запрос.УстановитьПараметр("Номер", тел);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						
						долж=ВыборкаДетальныеЗаписи.Владелец;
						
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					Если долж<>Неопределено Тогда
						
						
						     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
								// Данный фрагмент построен конструктором.
								// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
								
								Запрос = Новый Запрос;
								Запрос.Текст = 
									"ВЫБРАТЬ
									|	Договоры.НомерДоговора КАК НомерДоговора
									|ИЗ
									|	Справочник.Договоры КАК Договоры
									|ГДЕ
									|	Договоры.Владелец = &Владелец";
								
								Запрос.УстановитьПараметр("Владелец", долж);
								
								РезультатЗапроса = Запрос.Выполнить();
								
								ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
								
								Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
									// Вставить обработку выборки ВыборкаДетальныеЗаписи
									 догНомер=ВыборкаДетальныеЗаписи.НомерДоговора;
								КонецЦикла;
								
								//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

								
								
							  		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
									// Данный фрагмент построен конструктором.
									// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ
										|	Должники.Наименование КАК Наименование
										|ИЗ
										|	Справочник.Должники КАК Должники
										|ГДЕ
										|	Должники.Ссылка = &Ссылка";
									
									Запрос.УстановитьПараметр("Ссылка", долж);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										// Вставить обработку выборки ВыборкаДетальныеЗаписи
										должФИО=ВыборкаДетальныеЗаписи.Наименование;
									КонецЦикла;
									
									//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

									
						КонецЕсли;
					
						
						
			долждог.Вставить("ФИО",должФИО);			
			долждог.Вставить("Договор",догНомер);			
			
	
					
					
	  Возврат   долждог;

КонецФункции // ()


 
 


&НаСервере
Функция ЗаполнитьТабДок()

	  ТабДокумент=Новый ТабличныйДокумент;
	  
	  ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	  
	   Макет =  ОтчетОбъект.ПолучитьМакет("Макет");
	  
	  ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
      ТабДокумент.Вывести(ОбластьШапка);

	  
	  Для каждого Стр  Из ТЧ  Цикл
          ОбластьСтрока=Макет.ПолучитьОбласть("ОбластьСтрока");

		  
		  ОбластьСтрока.Параметры.датаВремя=Стр.Дата;
		  
		  ОбластьСтрока.Параметры.номер=Стр.Номер;
		  ОбластьСтрока.Параметры.текст=Стр.Текст;
		  ОбластьСтрока.Параметры.отчет=Стр.ОтчетОДоставке;
		  ОбластьСтрока.Параметры.должникСпр=Стр.Должник;
		  
		  ОбластьСтрока.Параметры.номердогСпр=Стр.НомерДоговора;
		  
		  
		  
		  ТабДокумент.Вывести(ОбластьСтрока);
		  
		  
	  КонецЦикла;		  
	  
	
	  
	 Возврат  ТабДокумент;

КонецФункции // ()




&НаСервере
Процедура ЗагрузитьВБазуНаСервере()
	
	
	   ФайлДанных = ИмяПути;
	   
	   ФайлЕксел.Прочитать(ИмяПути,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   
	   
	   ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	   
	   
	   Для каждого стр Из ТаблицаЗначений Цикл
		   
		    Если  стр.Должник<>"" и стр.НомерДоговора<>""  Тогда
		    
		    	 ЗаписатьВБазуСМС(стр.Должник,стр.НомерДоговора,стр.ДатаИВремя,стр.Номер,стр.Текст,стр.ОтчетОДоставке);
		    
		    КонецЕсли;
		   
		  
	   
	   КонецЦикла;
		   
	   
	   
			
		
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВБазуСМС(долж,дог,датавремя,номертел,текстсмс,отчет)

	   должникСпр=Неопределено;
	   
	               	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Должники.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Должники КАК Должники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
					|		ПО Договоры.Владелец = Должники.Ссылка
					|ГДЕ
					|	Должники.Наименование = &Наименование
					|	И Договоры.НомерДоговора = &НомерДоговора";
				
				Запрос.УстановитьПараметр("Наименование", долж);
				Запрос.УстановитьПараметр("НомерДоговора", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					должникСпр=ВыборкаДетальныеЗаписи.Ссылка;
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

				   
				
	            Если должникСпр<>Неопределено Тогда
					
					// проверю по дате
					
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	СМСсообщения.Ссылка КАК Ссылка
								|ИЗ
								|	Справочник.СМСсообщения КАК СМСсообщения
								|ГДЕ
								|	СМСсообщения.Владелец = &Владелец
								|	И СМСсообщения.ДатаВремя = &ДатаВремя";
							
							Запрос.УстановитьПараметр("Владелец", должникСпр);
							Запрос.УстановитьПараметр("ДатаВремя", датавремя);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							колСтр=ВыборкаДетальныеЗаписи.Количество();
							
							//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
							//КонецЦикла;
							//
						
							
						   Если колСтр=0 Тогда
							   
							   
							  спрЗапись=Справочники.СМСсообщения;
							  новыйСмс=спрЗапись.СоздатьЭлемент();
							  новыйСмс.Владелец=должникСпр;
							  новыйСмс.ДатаВремя=датавремя;
							  новыйСмс.НомерТел=номертел;
							  новыйСмс.Текст=текстсмс;
							  новыйСмс.ОтчетОДоставке=отчет;
							  новыйСмс.Записать();
							  
							
						   	
						   
						   КонецЕсли;	
					
							  
							  
						
				КонецЕсли;
				
				
				

КонецПроцедуры


   

&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)
	ЗагрузитьВБазуНаСервере();
	Сообщить("Ок")
КонецПроцедуры

&НаКлиенте
Процедура ИмяПутиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайлаДва", ЭтаФорма));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаДва(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяПути = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры
